Revit 2027 API
BaseExportOptions.GetExportLinetypeTable Method
 Gets a copy of the line type table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeTable GetExportLinetypeTable()
Public Function GetExportLinetypeTable As ExportLinetypeTable
public:
ExportLinetypeTable^ GetExportLinetypeTable()
member GetExportLinetypeTable : unit -> ExportLinetypeTable
Return Value
ExportLinetypeTable
 The line type table.
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace